-- MySQL dump 10.16  Distrib 10.1.13-MariaDB, for Win32 (AMD64)
--
-- Host: localhost    Database: trains
-- ------------------------------------------------------
-- Server version	10.1.13-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `train`
--

DROP TABLE IF EXISTS `train`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `train` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `degree` varchar(100) NOT NULL,
  `speed` varchar(100) NOT NULL,
  `leavingStation` varchar(100) NOT NULL,
  `arrivingStation` varchar(100) NOT NULL,
  `leavingTime` varchar(100) NOT NULL,
  `period` varchar(100) NOT NULL,
  `arrivingTime` varchar(100) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `train`
--

LOCK TABLES `train` WRITE;
/*!40000 ALTER TABLE `train` DISABLE KEYS */;
INSERT INTO `train` VALUES (1,'Mgary189','مكيف','185 كم/س','اسيوط','سوهاج','10.00 م','2.00 س','12.00 م'),(2,'55555','نوم','155 كم/س','اسيوط','الأقصر','1.30 م','8.00 س','9.30 م'),(3,'Lghtra99','اولى وثانية مكيفة','120 كم/س','ديروط','اسيوط','5.00 م','2.00 س','7.00 م'),(4,'Express','أكس بريس بعربيات مطوره(ركاب)ء','100 كم/س','اسيوط','المنيا','11.00 ص','2.30 س','1.30 م'),(5,'Motoree55','VIP','160 كم/س','رمسيس','الجيزة','10.00 م','30 د','10.30 م'),(6,'9999','مكيف','170 كم/س','اسيوط','بني سويف','5.00 ص','4.00 س','9.00 ص'),(7,'7676','أكس بريس بعربيات مطوره(ركاب)ء ','110 كم/س','القوصيه','اسيوط','10.00 م','1.30 س','11.30 م'),(8,'7575','VIP','195 كم/س','اسيوط','الجيزة','10.00 م','6.00 س','4.00 ص'),(9,'9797','مكيف','185 كم/س','اسيوط','رمسيس','10.00 م','6.30 س','4.30 ص'),(10,'gfdd','اولى وثانية مكيفة','115 كم/س','المنيا','ملوي','10.00 م','2.00 س','12.00 م'),(11,'gf4vfd54','نوم','185 كم/س','نجع حمادي','اسوان','10.00 ص','7.00 س','5.00 م'),(12,'feds87f','مكيف','185 كم/س','اسيوط','سوهاج','10.00 م','2.00 س','12.00 م'),(13,'fds48','اولى وثانية مكيفة','110 كم/س','اسيوط','قنا','10.00 م','3.00 س','1.00 ص'),(14,'fd1568','مكيف','185 كم/س','قنا','اسيوط','10.00 م','2.00 س','12.00 م'),(15,'4fd','نوم','190 كم/س','اسيوط','اسوان','10.00 م','8.00 س','6.00 ص'),(16,'egsuyhgsh','مكيف','180 كم/س','اسوان','اسيوط','10.00 م','8.00 س','6.00 ص'),(17,'sdks788','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','اسيوط','قنا','10.00 م','2.00 س','12.00 م'),(18,'Mgary189','VIP','185 كم/س','سوهاج','اسوان','10.00 م','6.00 س','4.00 ص'),(19,'Thania Mokayaf','اولى وثانية مكيفة','105 كم/س','سوهاج','الأقصر','8.00 م','4.00 س','12.00 م'),(20,'6767','مكيف','165 كم/س','قنا','سوهاج','1.00 م','2.00 س','3.00 م'),(21,'Rokab','أكس بريس بعربيات مطوره(ركاب)ء','110 كم/س','قنا','سوهاج','10.00 م','2.00 س','12.00 م'),(22,'Mokayaf2223','اولى وثانية مكيفة','145 كم/س','قنا','اسوان','2.00 م','4.00 س','6.00 م'),(23,'VIP8999','VIP','185 كم/س','اسوان','الجيزة','10.00 م','11.00 س','9.00 ص'),(24,'Mokayaf','اولى وثانية مكيفة','145 كم/س','قنا','المنيا','5.00 م','7.00 س','12.00 م'),(25,'AAJSUH56','مكيف','185 كم/س','المنيا','الأقصر','3.00 م','9.00 س','12.00 م'),(26,'Mgary189','مكيف','185 كم/س','المنيا','نجع حمادي','5.00 م','7.00 س','12.00 م'),(27,'ELganar777','VIP','185 كم/س','قنا','نجع حمادي','10.00 م','4.00 س','2.00 ص'),(28,'Saeed454','اولى وثانية مكيفة','145 كم/س','نجع حمادي','سوهاج','10.00 م','2.00 س','12.00 م'),(29,'Aqua','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','نجع حمادي','اسيوط','9.00 م','3.00 س','12.00 م'),(30,'PoGo','مكيف','185 كم/س','المنيا','اسيوط','11.00 م','2.00 س','1.00 ص'),(31,'Aqua333','نوم','185 كم/س','اسيوط','المنيا','10.00 م','2.00 س','12.00 م'),(32,'Sleep888','نوم','170 كم/س','اسيوط','بني سويف','8.00','4.00 س','12.00 ص'),(33,'VIP666','VIP','185 كم/س','بني سويف','اسيوط','10.00 م','4.00 س','2.00 ص'),(34,'Marakez','مكيف','170 كم/س','الجيزة','سوهاج','10.00 م','7.00 س','5.00 ص'),(35,'Saeed1233','اولى وثانية مكيفة','115 كم/س','قنا','الأقصر','10.00 م','2.00 س','12.00 م'),(36,'werd789','مكيف','185 كم/س','الجيزة','اسيوط','2.00 م','6.00 س','8.00 م'),(37,'LTh9','VIP','175 كم/س','الاسكندرية','اسيوط','10.00 م','12.00 س','10.00 ص'),(38,'M9999','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','الأقصر','سوهاج','9.00 م','3.00 س','12.00 م'),(39,'Sho169','مكيف','185 كم/س','الفشن','مطاي','10.00 م','1.00 س','11.00 م'),(40,'Galary189','مكيف','185 كم/س','الاسكندرية','سوهاج','10.00 م','14.00 س','12.00 ص'),(41,'ASD189','VIP','185 كم/س','اسيوط','الاسكندرية','10.00 م','14.00 س','12.00 ص'),(42,'Elsaree3','مكيف','185 كم/س','سوهاج','اسيوط','10.00 م','2.00 س','12.00 م'),(43,'Elmomiaz','أكس بريس بعربيات مطوره(ركاب)ء','185 كم/س','اسيوط','العياط','8.00 م','4.00 س','12.00 م'),(44,'Mgary189','مكيف','185 كم/س','اسيوط','سوهاج','10.00 م','2.00 س','12.00 م'),(45,'55555','نوم','155 كم/س','اسيوط','الأقصر','1.30 م','8.00 س','9.30 م'),(46,'Lghtra99','اولى وثانية مكيفة','120 كم/س','ديروط','اسيوط','5.00 م','2.00 س','7.00 م'),(47,'Express','أكس بريس بعربيات مطوره(ركاب)ء','100 كم/س','اسيوط','المنيا','11.00 ص','2.30 س','1.30 م'),(48,'Motoree55','VIP','160 كم/س','رمسيس','الجيزة','10.00 م','30 د','10.30 م'),(49,'9999','مكيف','170 كم/س','اسيوط','بني سويف','5.00 ص','4.00 س','9.00 ص'),(50,'7676','أكس بريس بعربيات مطوره(ركاب)ء ','110 كم/س','القوصيه','اسيوط','10.00 م','1.30 س','11.30 م'),(51,'7575','VIP','195 كم/س','اسيوط','الجيزة','10.00 م','6.00 س','4.00 ص'),(52,'9797','مكيف','185 كم/س','اسيوط','رمسيس','10.00 م','6.30 س','4.30 ص'),(53,'gfdd','اولى وثانية مكيفة','115 كم/س','المنيا','ملوي','10.00 م','2.00 س','12.00 م'),(54,'gf4vfd54','نوم','185 كم/س','نجع حمادي','اسوان','10.00 ص','7.00 س','5.00 م'),(55,'feds87f','مكيف','185 كم/س','اسيوط','سوهاج','10.00 م','2.00 س','12.00 م'),(56,'fds48','اولى وثانية مكيفة','110 كم/س','اسيوط','قنا','10.00 م','3.00 س','1.00 ص'),(57,'fd1568','مكيف','185 كم/س','قنا','اسيوط','10.00 م','2.00 س','12.00 م'),(58,'4fd','نوم','190 كم/س','اسيوط','اسوان','10.00 م','8.00 س','6.00 ص'),(59,'egsuyhgsh','مكيف','180 كم/س','اسوان','اسيوط','10.00 م','8.00 س','6.00 ص'),(60,'sdks788','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','اسيوط','قنا','10.00 م','2.00 س','12.00 م'),(61,'Mgary189','VIP','185 كم/س','سوهاج','اسوان','10.00 م','6.00 س','4.00 ص'),(62,'Thania Mokayaf','اولى وثانية مكيفة','105 كم/س','سوهاج','الأقصر','8.00 م','4.00 س','12.00 م'),(63,'6767','مكيف','165 كم/س','قنا','سوهاج','1.00 م','2.00 س','3.00 م'),(64,'Rokab','أكس بريس بعربيات مطوره(ركاب)ء','110 كم/س','قنا','سوهاج','10.00 م','2.00 س','12.00 م'),(65,'Mokayaf2223','اولى وثانية مكيفة','145 كم/س','قنا','اسوان','2.00 م','4.00 س','6.00 م'),(66,'VIP8999','VIP','185 كم/س','اسوان','الجيزة','10.00 م','11.00 س','9.00 ص'),(67,'Mokayaf','اولى وثانية مكيفة','145 كم/س','قنا','المنيا','5.00 م','7.00 س','12.00 م'),(68,'AAJSUH56','مكيف','185 كم/س','المنيا','الأقصر','3.00 م','9.00 س','12.00 م'),(69,'Mgary189','مكيف','185 كم/س','المنيا','نجع حمادي','5.00 م','7.00 س','12.00 م'),(70,'ELganar777','VIP','185 كم/س','قنا','نجع حمادي','10.00 م','4.00 س','2.00 ص'),(71,'Saeed454','اولى وثانية مكيفة','145 كم/س','نجع حمادي','سوهاج','10.00 م','2.00 س','12.00 م'),(72,'Aqua','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','نجع حمادي','اسيوط','9.00 م','3.00 س','12.00 م'),(73,'PoGo','مكيف','185 كم/س','المنيا','اسيوط','11.00 م','2.00 س','1.00 ص'),(74,'Aqua333','نوم','185 كم/س','اسيوط','المنيا','10.00 م','2.00 س','12.00 م'),(75,'Sleep888','نوم','170 كم/س','اسيوط','بني سويف','8.00','4.00 س','12.00 ص'),(76,'VIP666','VIP','185 كم/س','بني سويف','اسيوط','10.00 م','4.00 س','2.00 ص'),(77,'Marakez','مكيف','170 كم/س','الجيزة','سوهاج','10.00 م','7.00 س','5.00 ص'),(78,'Saeed1233','اولى وثانية مكيفة','115 كم/س','قنا','الأقصر','10.00 م','2.00 س','12.00 م'),(79,'werd789','مكيف','185 كم/س','الجيزة','اسيوط','2.00 م','6.00 س','8.00 م'),(80,'LTh9','VIP','175 كم/س','الاسكندرية','اسيوط','10.00 م','12.00 س','10.00 ص'),(81,'M9999','أكس بريس بعربيات مطوره(ركاب)ء','115 كم/س','الأقصر','سوهاج','9.00 م','3.00 س','12.00 م'),(82,'Sho169','مكيف','185 كم/س','الفشن','مطاي','10.00 م','1.00 س','11.00 م'),(83,'Galary189','مكيف','185 كم/س','الاسكندرية','سوهاج','10.00 م','14.00 س','12.00 ص'),(84,'ASD189','VIP','185 كم/س','اسيوط','الاسكندرية','10.00 م','14.00 س','12.00 ص'),(85,'Elsaree3','مكيف','185 كم/س','سوهاج','اسيوط','10.00 م','2.00 س','12.00 م'),(86,'Elmomiaz','أكس بريس بعربيات مطوره(ركاب)ء','185 كم/س','اسيوط','العياط','8.00 م','4.00 س','12.00 م');
/*!40000 ALTER TABLE `train` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-05-10 11:45:21
